# Finish Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchemaBuilder..::..Finish Method
SchemaBuilder Class See Also
---
Registers and returns the created Schema object.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Schema Finish()
```

Visual Basic
---
```text
Public Function Finish As Schema
```

Visual C++
---
```text
public:
Schema^ Finish()
```

# ### Return Value
The newly created Schema.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The SchemaBuilder has already finished building the Schema. -or- A different Schema with a matching identity already exists. -or- Two fields with the same name are detected. -or- At least one field has invalid units. -or- SchemaName is not set. -or- VendorId is not set for a restricted access level. -or- ApplicationGUID is not set for an application access level. -or- More than 256 fields were added to the schema. |

# See Also
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace